// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
let a = [1, 2, 3];
let b = [4, 5, 6];
let c = a.concat(b);
console.log(c);

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
let a = [1, 2, 3];
let b = a.reverse();
console.log(b);

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
let a = [1, 2, 3];
let b = a.push(4 ,5, 6);
console.log(b);

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
let a = [1, 2, 3];
let b = a.unshift(4 ,5, 6);
console.log(b);

// 5. Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
let a = ['js', 'css', 'jq'];
let b = a.shift();
console.log(b);

// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
let a = ['js', 'css', 'jq'];
let b = a.pop();
console.log(b);

// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
let a = [1, 2, 3, 4, 5];
let b = a.slice(0, 3);
console.log(b);

// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].
let a = [1, 2, 3, 4, 5];
let b = a.slice(3);
console.log(b);

// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
let a = [1, 2, 3, 4, 5];
let b = a.splice(1, 2);
console.log(a);

// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
let a = [1, 2, 3, 4, 5];
let b = a.splice(1, 3);
console.log(b);

// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let a = [1, 2, 3, 4, 5];
let b = a.splice(2, 0, 'a', 'b', 'c');
console.log(a);

// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
let a = [1, 2, 3, 4, 5];
a.splice(1, 0, 'a', 'b');
a.splice(6, 0, 'c');
a.splice(8, 0, 'e');
console.log(a);

// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
let a = [3, 4, 1, 2, 7];
let b = a.sort();
console.log(b);

// 14. Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.
let obj = {
    js:'test',
    jq: 'hello',
    css: 'world'
}
let b = Object.keys(obj);
console.log(b);